# Вывести на экран текст "Hello, world!"
print("Hello, world!")