# Вывести на экран пять строк из нулей,
# причем количество нулей в каждой строке
# равно номеру строки.

# Без использования циклов
#code...

# С использование цикла
#code...

print('0'*1)
print('0'*2)
print('0'*3)
print('0'*4)
print('0'*5)


for i in range(6):
    print('0'*i)