# Вывести на экран прямоугольник,
# заполненный буквами А. Количество
# строк в прямоугольнике равно 5,
# количество столбцов равно 8.
# Надо использовать цикл

for i in range(6):
    print("A"*8)