# Пользователь вводит два числа (7, 4).
# Найдите сумму, произведение данных чисел,
# квадрат первого числа (вторая степень) и
# куб (треться степень) второго числа.

a = float(input())
b = float(input())

print(a+b)
print(a*b)
print(a**2)
print(b**3)
